app/views/foods/show.html.erb

  <ul>
    <% @food.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."food_id" = ?  [["food_id", 3]]