app/controllers/desserts_controller.rb

  def index
    @desserts = Dessert.all
---
SELECT "desserts".* FROM "desserts"

  def create
    @dessert = Dessert.new(dessert_params)

    respond_to do |format|
      if @dessert.save
---
INSERT INTO "desserts" ("business", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["business", "1"], ["website", "1"], ["created_at", "2020-06-03 00:44:24.345365"], ["updated_at", "2020-06-03 00:44:24.345365"]]

  def destroy
     Dessert.find(params[:id]).destroy
---
DELETE FROM "desserts" WHERE "desserts"."id" = ?  [["id", 2]]
SELECT "desserts".* FROM "desserts" WHERE "desserts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_dessert
      @dessert = Dessert.find(params[:id])
---
SELECT "desserts".* FROM "desserts" WHERE "desserts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]