app/controllers/drinks_controller.rb

  def index
    @drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"

  def create
    @drink = Drink.new(drink_params)

    respond_to do |format|
      if @drink.save
---
INSERT INTO "drinks" ("business", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["business", "1"], ["website", "1"], ["created_at", "2020-06-01 21:34:14.079582"], ["updated_at", "2020-06-01 21:34:14.079582"]]

  def update
    respond_to do |format|
      if @drink.update(drink_params)
---
UPDATE "drinks" SET "website" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["website", "☕️ + Edit"], ["updated_at", "2020-06-01 21:36:52.720684"], ["id", 4]]

  def destroy
     Drink.find(params[:id]).destroy
---
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 1]]
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_drink
      @drink = Drink.find(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]