app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @food = Food.find(params[:id])

INSERT INTO "foods" ("business", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["business", "Teter Organic Farm"], ["website", "t.com"], ["created_at", "2020-06-16 00:02:31.858989"], ["updated_at", "2020-06-16 00:02:31.858989"]]
---
  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "foods" SET "website" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["website", "spencerberryfarm.com/"], ["updated_at", "2020-06-17 17:35:40.369840"], ["id", 11]]
---
  def update
    @food = Food.find(params[:id])
    @food.update(business: params[:food][:business], website: params[:food][:website])

DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 9]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def destroy
     Food.find(params[:id]).destroy